let handler = async (m, { conn, text, participants, isAdmin, isOwner, groupMetadata }) => {
    let users = participants.map(u => u.id).filter(v => v !== conn.user.jid)
    m.reply(`.      ׅㅤׄㅤׅㅤׄᅠ⋱╲ㅤ֪    ⦙ㅤ֪ㅤ╱⋰ᅠׄᅠׅᅠׄᅠׅ
     ⏜⌒፝֟𝄄𝅦𝄄፝֟ᮬ࿙࿚ㅤ(╲ㅤ︵ㅤ╱)ㅤ࿙࿚፝֟𝄄𝅦𝄄ᮢ፝֟⌒⏜ 
*♡゚⃞⿵꯭█꯭█⃞꯭ ꯭֢֟፝🍒꯭֢ׅ֟፝𝐄ׂ𝕥ׅᩘ︩︪ᦅׂ𝕚𝅦ׅᥫׂᧉׅ⃨⃕𝘀ׂᩙ Гּ໋۪۫ᥝ๋⃨ࣼᦋᩤ𝗂᷒ᰰ𑂘᜔ֺּ︩︪۟ɬ   ꯭ׅ֢🍒꯭ׂׅ֢֟፝ ⃞꯭██꯭⿵♡゚⃞*     

     ּּ   ︶۪۪۪֟፝᷼͝⏝ ׅ  ᩧ   ּ.  ⸽⦙᷼͝ᗣ⵿͠ᩘ⵿۪۪۪۪𝄄𝅦𝄄⵿ᩘ۪۪۪۪ᗣ᷼͝⦙⸽  ׅ     ᳞  ᩧ ⏝۪۪۪ׅ֟፝᷼͝︶ ׂ  ׅ \n\n ${text ? `\n ▬᳢̅ ⃞⚜️ᩥ᪶ 𝐌𝐞𝐬𝐬𐐼ɠ𝐞: ${text}\n` : ''}\n\n` + users.map(v =>' ᜔ִ۫𑁯੭ ᮫໋۪࣭  𐔌⃘𝅦֟፝͜͡͞🍒ᩙ̸̷⃘᳟― @' + v.replace(/@.+/, '')).join`\n` + '\n .   ꒰꒱   ׄ    ׅ╾ׄ┄╼    ׅ   ✿   ׅ    ╾┄ׄ╼ׅ   ׂ   ꒰꒱   . 𝓒͜͡ჩ𝅦፝֟͜͡ᧉ͜͡г͜͡г͜͡ɥׅ  ׅᨢ͜͡ℓ͜͡𖹭͜͡𖹭͜͡ຣ𝅦፝֟͜͡ຣ͜͡𖹭͜͡ᥖ͜͡ຣׅ  ׅᨢ͜͡ℓ͜͡𖹭𝅦֟፝͜͡𖹭͜͡ᥖׅ  ׅ𖹭͜͡ռ𝅦፝֟͜͡ℓ͜͡ɥׅ  ׅƒ͜͡𖹭𝅦፝֟͜͡гׅ  ׅɑ𝅦፝֟͟ ׅ  ᥖ͜͡𖹭𝅦֟፝͜͡ᥖ͜͡ᧉ͜͡ռ͜͡է❟ ׅᨢ͜͡ʋ͜͡էׅ  ׅ𝛊ᩥ፝֟͜͡ռׅ  𝝣𝝩𝝮𝝞𝗟𝝣𝗦❟ է͜͡ჩ͜͡ᧉׅ  ׅᨢ͜͡ᧉ͜͡ɑ𝅦፝֟͜͡ʋ͜͡է͜͡ɥׅ  ׅຣ͜͡է𝅦֟፝͜͡ɑ͜͡ɥ͜͡ຣׅ  ׅƒ͜͡𖹭͜͡г𝅦፝֟͜͡ᧉ͜͡𐔝͜͡ᧉ͜͡гׅ ｡ ׅ𝓑͜͡ᧉ͜͡ռ𝅦֟፝͜͡ᧉ͜͡ɑ͜͡է͜͡ჩׅ  ׅէ͜͡ჩ͜͡ᧉׅ  ׅɕ͜͡ჩ͜͡ᧉ𝅦፝֟͜͡г͜͡г͜͡ɥׅ  ׅᨢ͜͡ℓ͜͡𖹭͜͡𖹭𝅦፝֟͜͡ຣ͜͡ຣ͜͡𖹭͜͡ᥖׅ  ׅຣ͜͡ӄ͜͡𝛊ᩥ𝅦፝֟͜͡ᧉ͜͡ຣׅ ❟ ׅຝ͜͡ჩ͜͡ᧉ𝅦֟፝͜͡г͜͡ᧉׅ  ׅρ͜͡ᧉ͜͡է𝅦፝֟͜͡ɑ͜͡ℓ͜͡ຣׅ  ׅƒ͜͡ɑ𝅦፝֟͜͡ℓ͜͡ℓׅ  ׅℓ͜͡𝛊ᩥ𝅦֟፝͜͡ӄ͜͡ᧉׅ   ׅ ׅ  ׅຣ͜͡է͜͡ɑ͜͡г𝅦֟፝͜͡ꛆ͜͡ʋ͜͡ຣ͜͡էׅ ❟ ׅɥ͜͡𖹭͜͡ʋ𝅦፝֟͜͡❜͜͡𐔝͜͡ᧉׅ  ׅƒ͜͡𖹭͜͡ʋ𝅦֟፝͜͡ռ͜͡ꛆׅ  ׅɑ𝅦፝֟͟  ׅჩ͜͡𖹭𝅦֟፝͜͡ᥖ͜͡ᧉׅ ｡ ׅ𝚨𝅦ׅ֟፝͟  ׅρ͜͡ℓ͜͡ɑ𝅦֟፝͜͡ɕ͜͡ᧉׅ  ׅຝ͜͡ჩ͜͡ᧉ𝅦፝֟͜͡г͜͡ᧉׅ  ׅӄ͜͡𝛊ᩥ͜͡ռ͜͡ꛆ𝅦֟፝͜͡ռ͜͡ᧉ͜͡ຣ͜͡ຣׅ  ׅຣ͜͡ρ͜͡ᧉ𝅦፝֟͜͡ɑ͜͡ӄ͜͡ຣׅ  ׅ𝛊ᩥᩥ𝅦֟፝͜͡ռׅ  ׅɕ͜͡𖹭͜͡ℓ𝅦፝֟͜͡𖹭͜͡г͜͡ຣׅ ❟ ׅɑ𝅦֟፝͜͡ռ͜͡ꛆׅ  ׅᧉ͜͡𐔝𝅦֟፝͜͡ᧉ͜͡г͜͡ɥׅ  ׅг͜͡ᧉ͜͡զ͜͡ʋ𝅦፝֟͜͡ᧉ͜͡ຣ͜͡էׅ  ׅᨢ͜͡ℓ͜͡𖹭𝅦፝֟͜͡𖹭͜͡ᥖ͜͡ຣׅ  ׅ𝛊ᩥ͜͡ռ𝅦֟፝͜͡է͜͡𖹭ׅ  ׅᥖ͜͡ɑ𝅦֟፝͜͡ᦋ͜͡𝛊ᩥ͜͡ɕׅ ｡ ', null, {
        mentions: users
    })
}

handler.help = ['tagall']
handler.tags = ['group']
handler.command = ['tagall']
handler.admin = false
handler.group = true

export default handler
