let handler = async (m, { conn, text, participants, groupMetadata }) => {
  let users = participants.map(u => u.id).filter(v => v !== conn.user.jid)

  let winter = `
︵۫᷼⏜꯭፝֟︵ ︵۫᷼⏜꯭፝֟ ❄️•❅•❄️ ︵꯭፝֟⏜۫᷼︵ׅ︵꯭፝֟⏜۫᷼︵ׅ︵꯭፝֟⏜۫᷼︵ׅ
      𝐖𝗂𐓣𝗍𝖾𝗋 𝚰𝗌 𝐂ⱺꭑ𝗂𐓣𝗀☃️ 
  𝐂ⱺᥣᑯ ᑯα𝗒𝗌 𝐂ⱺᥣᑯ𝖾𝗋 𝐌𝖾ꭑⱺ𝗋𝗂𝖾𝗌
⏝݄︶ּ፝֟⏝᷼︶֘⏝݄︶ּ፝֟⏝᷼︶֘ ❄️•❅•❄️︶᷼⏝ּ፝֟︶݄⏝⃯ׄ︶᷼⏝ּ፝֟︶݄⏝⃯ׄ  

▌ ❄️ *𝐆𝗋ⱺυρ:* ${groupMetadata.subject}
▌ ❄️ *𝐌𝖾ꭑᑲ𝖾𝗋𝗌:* ${participants.length}
${text ? `▌ ❄️ *Message:* ${text}\n` : ""}

🌨️ *𝐒𐓣ⱺω𝖿ᥣα𝗄𝖾 𝐌𝖾𐓣𝗍𝗂ⱺ𐓣* 🌨️
───────────────────────
${users.map(v => `━ ✦ ⃞🧊• @${v.split("@")[0]}`).join("\n")}
───────────────────────

❄️ “𝐒𐓣ⱺω𝖿ᥣα𝗄𝖾𝗌 𝖿αᥣᥣ… ᑲυ𝗍 ꭑ𝖾ꭑⱺ𝗋𝗂𝖾𝗌 𝗌𝗍α𝗒.” ❄️
  `.trim()

  m.reply(winter, null, { mentions: users })
}

handler.help = ['tagall']
handler.tags = ['group']
handler.command = ['tagall']
handler.desc = 'Winter Theme TagAll'
handler.admin = false
handler.group = true

export default handler
